Tekla.Structures.AnalysisInternal.DotAnalysisMember
The serialization structure for the AnalysisMember.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._AnalysisObject
The analysis object instance.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._Material
The material of the analysis member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._Label
The label of the analysis member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._Start
The analysis beam end settings at the start of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._End
The analysis beam end settings at the end of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._Curvature
The beam curvature of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._Composite
The composite settings of the member.

Tekla.Structures.AnalysisInternal.DotAnalysisMember._AnalysisDesignCode
The analysis design code.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.ToStruct(Tekla.Structures.Analysis.AnalysisMember)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisMember.FromStruct(Tekla.Structures.Analysis.AnalysisMember)
DO NOT USE! For internal usage only!
P: P.